# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

day = input('Введите номер дня: ')
if day == '1':
    print('Этот день является будним днем.')
elif day == '2':
    print('Этот день является будним днем.')
elif day == '3':
    print('Этот день является будним днем')
elif day == '4':
    print('Этот день является будним днем')
elif day == '5':
    print('Этот день является будним днем')
elif day == '6':
    print('Этот день является выходным днем')
elif day == '7':
    print('Этот день является выходным днем')
else:
    print('Этого дня нету в неделе')
    #fsd